const timu = [
    {
        wenti:"你和别人相处的性格更偏向？",
        xuanxiang:[
            "喜欢主动交流",
            "喜欢关心别人",
            "喜欢观察分析",
            "喜欢保持自己的节奏"
        ],
    },

    {
        wenti:"你喜欢什么样的生活方式？",
        xuanxiang:[
            "喜欢热闹，和很多人一起",
            "喜欢安静，享受独处",
            "喜欢有计划有目标的生活",
            "喜欢自由，不喜欢被束缚"
        ],
    },

    {
        wenti:"遇到困难时你会？",
        xuanxiang:[
            "马上解决问题",
            "先冷静思考",
            "找别人帮助",
            "先放一放，过段时间再看"
        ],
    },

    {
        wenti:"你在一段关系中通常扮演什么角色？",
        xuanxiang:[
            "主导者，喜欢掌控节奏",
            "支持者，愿意默默付出",
            "思考者，喜欢分析和规划",
            "调节者，不喜欢被过度限制"
        ],
    },

    {
       wenti:"你对新事物的态度是？",
       xuanxiang:[
        "很感兴趣，迫不及待尝试",
        "观望一下，再决定要不要试",
        "先了解清楚再行动",
        "不太感兴趣，除非有必要"
       ],
    },

    {
        wenti:"在一个陌生的聚会上，你通常会？",
        xuanxiang:[
            "主动认识别人，带动气氛",
            "先和周围比较熟悉的人交流，让大家舒服",
            "观察周围的人和环境，慢慢融入",
            "看自己的兴趣，没有必要不会行动"
        ],
    },

    {
        wenti:"你如何表达喜欢？",
        xuanxiang:[
            "直接表达",
            "用行动关心对方",
            "通过言语和文字",
            "默默陪伴在身边"
        ],
    },

    {
        wenti:"你理想的周末是？",
        xuanxiang:[
            "和朋友出去玩",
            "和喜欢的人一起度过轻松的事",
            "学习或做有意义的事情",
            "一个人按照自己的想法随心安排"
        ],
    },

    {
        wenti:"面对压力时，你更倾向于？",
        xuanxiang:[
            "积极面对，努力解决",
            "找人倾诉，释放情绪",
            "自我调整，努力消化",
            "转移注意力，先放松一下"
        ],
    },

    {
        wenti:"你认为爱情最重要的是？",
        xuanxiang:[
            "心动和激情",
            "信任和安全感",
            "共同成长和进步",
            "自由和理解"
        ],
    },
];